---
kind: other
id: Properties.T:Autodesk.Revit.DB.IFC.IFCFileReadOptions
source: html/bc81edab-570f-df62-7529-64a789ef875b.htm
---
# IFCFileReadOptions Properties

The full file name of the IFC file to be read.